[{"slug": "BTtxyrRgsB", "name": "Introduction to HCI Design", "code": "CS147", "university": "Standford University", "description": "Through lectures and a project, learn the fundamentals of human-computer interaction and design thinking. Work together in teams of three on a quarter-long project. Each week, in small design studios, present and discuss work with peers. The setting for the course is mobile web applications. The constraints of this small form factor make this an exciting challenge. At the end of the course, present to a jury of IT and design leaders.", "url": "https://hci.stanford.edu/courses/cs147/2019/au/", "prerequisites": null, "core_for_major": false, "last_taught": "10/06/2019, 00:00:00", "instructor": "James Landay", "learning_goals": "The dt+UX course focuses on bringing design thinking, processes, and tools to user experience design. From sketching to hands-on studio sessions, students in the dt+UX course learn the importance of making many design artifacts before narrowing down the space to focus on a final design. \r\nPrototyping is the key tool to move ideas out of a designer's head and put them into a tangible form to evaluate for inclusion in the next design iteration. Students in the dt+UX course produce prototypes that range from paper sketches to concept videos to wireframes to code running on the target platform.\r\nEvaluation is how we choose whether a design or feature moves forward in our process or needs to be discarded or revised. Students in the dt+UX course learn and use evaluation techniques that run the gamut from critique to expert evaluation to usability testing in the lab or field to remote usability testing.", "equivalent": ["iuw1O15oTj"]}, {"slug": "iuw1O15oTj", "name": "HCI design studio", "code": "CS247", "university": "Standford University", "description": "This class teaches advanced techniques in human-computer interaction design, with a focus on challenging design contexts. Topics include visual communication, diary studies, journey maps, theories of behavior change, wireflows, design patterns, design systems, information architecture, grid systems, and remote usability studies.", "url": "https://hci.stanford.edu/courses/cs247/2019-winter/index.shtml#calendar", "prerequisites": "CS147, or equivalent experience in design thinking", "core_for_major": false, "last_taught": "10/06/2019, 00:00:00", "instructor": "Christina Wodtke", "learning_goals": "Visual communication: sketching.Needfinding: diary studies, journey maps, interviewing with critical incidents and status differentials.Interaction: wireflows, information architecture, navigation design, design patterns.Visual design: grids, design systems, style tiles.Evaluation: longitudinal field studies, remote usability studies", "equivalent": ["BTtxyrRgsB"]}, {"slug": "DQ9KIo2Q94", "name": "Introduction to Human-Computer Interaction for Technology Executives", "code": "05-863", "university": "Carnegie Mellon University", "description": "Human-computer interaction (HCI) is an interdisciplinary field in which computer scientists, engineers, psychologists, social scientists, and design professionals play important roles. The goal of HCI is to solve real problems in the design and use of technology, making computer-based systems easier to use and more effective for people and organizations. Ease of use and effectiveness are critical to the success of any systems that interact with people, including software systems, home, office and factory appliances, and web and phone applications. This course provides an overview and introduction to the field of human-computer interaction, with a focus on how it applies to managers, technology executives, and others who will work with HCI professionals. Particular emphasis will be placed on what HCI methods and HCI-trained specialists can bring to design and development teams. The course will introduce students to proven tools and techniques for creating and improving user interfaces, such as Contextual Inquiry, Rapid Prototyping, Heuristic Analysis, and Think-Aloud User Testing. Students at the end of the course will have learned some useful techniques and an understanding of systematic procedures for creating usable and useful designs and systems.", "url": "http://www.cs.cmu.edu/~bam/uicourse/05863fall18/", "prerequisites": null, "core_for_major": false, "last_taught": "10/06/2018, 00:00:00", "instructor": "Brad Myers", "learning_goals": "Students at the end of the course will have learned how to perform some useful techniques and will have an understanding of systematic procedures for creating usable and useful designs and systems. The course will provide a hands-on introduction to proven tools and techniques for creating and improving user interfaces, such as Contextual Inquiry, Rapid Prototyping, Heuristic Analysis, and Think-Aloud Usability Testing. Particular emphasis will be placed on what HCI methods and HCI-trained specialists can bring to design and development teams. This course provides an overview and introduction to the field of human-computer interaction, with a focus on how it applies to managers, technology executives, and others who will work with HCI professionals.", "equivalent": []}, {"slug": "V09ueiKd3c", "name": "Human Computer Interaction & User Experience", "code": "49-780", "university": "Carnegie Mellon University", "description": "This graduate-level short course exposes Software Engineering and Management\r\nprofessionals to the field of Human-Computer Interaction (HCI) and User\r\nExperience (UX). In the modern marketplace, the winners are those who enable\r\nreal people to harness the power of technology innovations in delightful ways.\r\nDelighting customers through technology requires a strong foundation in HCI\r\nand a focus on UX. This course is primarily for those who come from a technical\r\nor business background but are interested in gaining relevant knowledge and\r\nbasic skills in HCI/UX in an interactive, fast-paced, and engaging format.", "url": null, "prerequisites": null, "core_for_major": false, "last_taught": "10/06/2000, 00:00:00", "instructor": "nan", "learning_goals": "To provide an overview across the breadth of HCI/UX disciplines to understand the relevant roles, responsibilities, processes, methodologies, concepts, tools, and deliverables expected of them\r\nThrough increased knowledge and understanding, establish empathy with HCI/UX practitioners in order to establish productive working relationships.\r\nTo provide a theoretical & practical foundation for the HCI & UX practice within modern product development., Understand the underlying history & theory through relevant readings, discussions, and presentations, Gain practical experience through team-based project work, presentations, and critique., Work together in cross-functional teams using a User-Centered Design (UCD) approach.\r\nTo create a greater appreciation for the intellectual, emotional, and practical value of HCI & UX.", "equivalent": ["NrbH3xvKSf"]}, {"slug": "PPkQKTxDB7", "name": "Human Factors and User Interface Design", "code": "CSCI2310", "university": "Brown University", "description": "Covers current research issues in the implementation, evaluation, and design of user interfaces, while also providing a basic background in user interface evaluation, programming, tools, and techniques. A possible topic is programming and designing device-independent interfaces. Previous topics have included the development of pervasive Internet-based interfaces and software visualization. Prerequisite: consent of instructor.", "url": null, "prerequisites": "professor consent", "core_for_major": false, "last_taught": "10/06/2000, 00:00:00", "instructor": "Steven P Reis", "learning_goals": "", "equivalent": []}, {"slug": "NrbH3xvKSf", "name": "User Interface Design", "code": "COMS W4170", "university": "Duke University", "description": "provides a general introduction to the theory and practice of user interface design. The fundamental question that we will try to answer is, “How can we create high-quality user interfaces?” Our emphasis will be on the design of 2D graphical user interfaces. We will survey the basic technologies available and the techniques that have been developed for (or have given rise to) them and will study several important paradigms for how these techniques can be woven into a coherent dialogue. This will provide a framework within which we can analyze existing user interfaces and design new ones.", "url": "http://www.cs.columbia.edu/~feiner/courses/csw4170/", "prerequisites": "COMS W313X", "core_for_major": false, "last_taught": "10/06/2018, 00:00:00", "instructor": "Steven Feiner", "learning_goals": "", "equivalent": ["V09ueiKd3c", "xAhoHedYeR"]}, {"slug": "iZ4R00sYVo", "name": "Introduction to Interaction Design and Virtual Environments", "code": "ISS 320S", "university": "Duke University", "description": "Fundamental concepts of Human-Computer Interaction (HCI) and Virtual Reality (VR) technology and techniques. User-centered design concepts and how they are applied to the development of virtual environments (VEs). Basic concepts of 3D interaction design. Practical experience with hardware and software used to create VE applications. Experience in Duke Immersive Virtual Environment (the 6-sided CAVE) and with other 3D systems. User interface evaluation and metrics. Individual and team-based projects, papers, quizzes, exam", "url": null, "prerequisites": null, "core_for_major": false, "last_taught": "10/06/2000, 00:00:00", "instructor": "nan", "learning_goals": "", "equivalent": ["tpqPP5LIHP"]}, {"slug": "6dfrbVIyKO", "name": "Human-Computer Interface Design", "code": "ISE 470", "university": "University of Southern California", "description": "This course covers topics of introductory nature on human-computer interaction (HCI).\r\nHCI focuses on how to design tech products that can be used easily, efficiently, and\r\nsafely. The course also offers simple evaluation methodologies and tools to analyze a\r\ndevice’s interface.", "url": "https://web-app.usc.edu/soc/syllabus/20181/31616.pdf", "prerequisites": null, "core_for_major": false, "last_taught": "10/06/2019, 00:00:00", "instructor": "Yalda Khashe", "learning_goals": "Why some interfaces are good and others are poor?\r\nHow we can figure out the user's needs to design better products?\r\nWhat are user abilities and limitations while interacting with a device?\r\nWhat are the key concepts of user-centered design?\r\nHow to design for different kinds of interactions among users and devices?\r\nHow to design for targeted users versus designing for a broad spectrum of users?\r\nHow to use scenarios, personas, and use cases to develop low fidelity prototypes?\r\nWhen to use qualitative versus quantitative evaluation methods for our designs?", "equivalent": []}, {"slug": "5KcL4Wc1s3", "name": "The Design of Interactive Computational Media", "code": "CSC 318", "university": "University of Toronto", "description": "User-centered design of interactive systems; methodologies, principles, and metaphors; task analysis. Interdisciplinary design; the role of graphic design, industrial design, and the behavioral sciences. Interactive hardware and software; concepts from computer graphics. Typography, layout, color, sound, video, gesture, and usability enhancements. Classes of interactive graphical media; direct manipulation systems, extensible systems, rapid prototyping tools. Students work on projects in interdisciplinary teams.", "url": "https://csc318-fall2018.github.io/", "prerequisites": "Any CSC half-course", "core_for_major": false, "last_taught": "10/06/2018, 00:00:00", "instructor": "Fanny Chevalier", "learning_goals": "to practice research methods for understanding user needs and practices, to interpret raw data and create design artifacts (e.g., personas, job stories, scenarios), to brainstorm, sketch and design prototypes that solve real user problems, to evaluate prototypes (one’s and others’) for usability, learnability, and usefulness, to work in multidisciplinary design teams.", "equivalent": []}, {"slug": "rwp3FEHhhs", "name": "Human-Computer Interaction", "code": "CSC 428", "university": "University of Toronto", "description": "Understanding human behavior as it applies to user interfaces: work activity analysis, observational techniques, questionnaire administration, and unobtrusive measures. Operating parameters of the human cognitive system, task analysis, and cognitive modeling techniques and their application to designing interfaces. Interface representations and prototyping tools. Cognitive walkthroughs, usability studies, and verbal protocol analysis. Case studies of specific user interfaces.", "url": null, "prerequisites": null, "core_for_major": false, "last_taught": "10/06/2000, 00:00:00", "instructor": "Tovi Grossman", "learning_goals": "", "equivalent": []}, {"slug": "JxDz3u2z4j", "name": "Introduction to Human Computer Interaction Methods", "code": "CPSC 344", "university": "Universisty of British Columbia", "description": "Basic tools and techniques, teaching a systematic approach to interface design, task analysis, analytic and empirical evaluation methods. [2-2-2]", "url": "https://www.students.cs.ubc.ca/~cs-344/current-term/", "prerequisites": "One of CPSC 210, EECE 210, EECE 309, CPEN 221.", "core_for_major": false, "last_taught": "10/06/2018, 00:00:00", "instructor": "Dongwook Yoon (yoon@cs.ubc.ca)", "learning_goals": "Upon completion of this course, students will be able to: \r\nList heuristics for basic good/bad interface design. \r\nBe able to identify and critique interface strengths and weaknesses in terms of this language. \r\nContrast the central principles of user-centered versus technology-centered design, and in a given situation, identify and explain which approach to design may be appropriate to use.\r\nExplain why one's personal design intuition merits skepticism. For a given design context, list specific HCI practices and tools that can help to inform and educate it. \r\nList and describe models we have of human users (mental models, cognitive resources, sensory processing), vs models that humans have of systems. \r\nList and categorize key user capabilities; and for a given design challenge, identify the most relevant ones. \r\nObserve, describe and analyze user activities and needs in terms of their tasks.\r\nConstruct solutions focused on accounting for human limitations; identify evaluation methods that will confirm success in this. \r\nDemonstrate the ability to first design a system at a conceptual level; i.e. the 'bones' versus 'skin' of the design. Demonstrate ability to secondly design the external views of a system (i.e. the 'skin') considering course principles including mental models, human cognition, visual design, etc. \r\nDescribe the central HCI techniques, frameworks or processes, in the context of their purpose: e.g. in providing structure for understanding tasks, identifying interaction problems, design alternatives, and next-step process choices. \r\nFormulate and act upon an iterative, progressively narrowing design approach, in which you seek alternatives and avoid freezing your approach too early.\r\nList methods for, and demonstrate parsimony and effectiveness in the deployment of evaluation and prototyping tools. Use in a targeted and minimalist way, to focus on the question at hand; avoid wasting effort, and elicitation of unhelpful or ambiguous user feedback.\r\nBe able to critique and evaluate the quality of yours and others' designs appropriately at multiple stages, and articulate/defend your design decisions.\r\nDemonstrate competency in three communication mediums singly and with your team: in written project reports, informal oral presentation, and in respectfully critiquing, articulating and defending the teams' ideas, challenges and questions to one another, peers and course staff, over the course of the term.\r\nList and describe several methods you have used for team coordination, work management and conflict resolution in the context of multi-week projects; reflect on what worked best; appraise which best suits your own style.", "equivalent": []}, {"slug": "7V2wYn5BYF", "name": "Advanced Methods for Human Computer Interaction", "code": "CPSC 444", "university": "Universisty of British Columbia", "description": "Design and evaluation methodologies and theories; formal models of the user including visual, motor, and information processing; advanced evaluation methods including laboratory experiments and field studies; HCI research frontiers. [2-2-2]", "url": "https://www.students.cs.ubc.ca/~cs-444/", "prerequisites": "All of CPSC 310, CPSC 344 and one of STAT 200, STAT 241.", "core_for_major": false, "last_taught": "10/06/2019, 00:00:00", "instructor": "Joanna McGrenere (joanna@cs.ubc.ca)", "learning_goals": "Upon completion of this course, students will: have knowledge of models of the user and how they apply to the design of user interfaces. be familiar with the variety of techniques and methods for interface design, evaluation, and analysis. have experience designing and running a field study and performing qualitative data analysis. have experience designing and running a controlled experiment and performing quantitative data analysis. have experience working with video in an HCI context: (1) to capture user data, and (2) to create a project video. have experience with some sophisticated tools for interface prototyping and analysis and user observation. be familiar with research issues in HCI. Have enough background to apply these principles and practices in the industry, and to continue to further education and research in this area have experience reading research papers and identifying the contribution of those papers. have honed their team skills through the completion of an iterative design term project", "equivalent": []}, {"slug": "KUmFe524qu", "name": "User Interfaces", "code": "CS 349", "university": "University of waterloo", "description": "An introduction to contemporary user interfaces, including the basics of human-computer interaction, the user interface design/evaluation process, the event abstraction, user interface components, specification of user interfaces, and the architectures within which user interfaces are developed. Implementation and evaluation of a typical user interface are considered.", "url": "https://www.student.cs.uwaterloo.ca/~cs349/s19/", "prerequisites": "CS 241 and (one of MATH 115, 136, 146); Computer Science students only", "core_for_major": false, "last_taught": "10/06/2019, 00:00:00", "instructor": "Jeff Avery (jeff.avery@cs.uwaterloo.ca)", "learning_goals": "", "equivalent": []}, {"slug": "vIWzFCbMEh", "name": "Human Computer Interaction", "code": "CS 449", "university": "University of waterloo", "description": "An introduction to the fundamental theories, methods, and research in the design and evaluation of novel computational artifacts designed to meet real-world human needs.", "url": "https://www.student.cs.uwaterloo.ca/~cs449/s19/#home", "prerequisites": "CS 240, 241; Level at least 3B; Computer Science students only.", "core_for_major": false, "last_taught": "10/06/2019, 00:00:00", "instructor": "Anastasia Kuzminykh (akuzminy@cs.uwaterloo.ca), Ed Lank (lank@cs.uwaterloo.ca)", "learning_goals": "By the end of the course, you will be able to: Identify the primary luminaries relevant to Interactive Design and HCI. Identify major movements in HCI research, and their motivations, philosophies, and goals. identify your target users, design studies to understand your users and their needs within a sociocultural context. Create user data-driven designs and prototypes of different levels of fidelity. Design studies to evaluate design on different stages of development. Properly gather and analyze qualitative and quantitative data from user studies including data from in-situ observations, semi-structured interviews, field studies, in-house experiments, heuristic evaluation distinguish bad and good experimental design and high-quality design of your own product to your portfolio", "equivalent": []}, {"slug": "n1vpJJY0he", "name": "User Centred Design Methods", "code": "SYDE 348", "university": "University of waterloo", "description": "This course approaches the design tasks, tools, products and systems from a user-centered design perspective. Emphasis is on the human factors and usability methods and techniques that can and should be applied throughout the iterative design process. While design issues pertaining to human-computer interaction are discussed, the methods presented can be applied to the design of almost any user interface. Major topics include: function and task analysis, usability analysis, prototyping and evaluation, user interaction styles, interface design, user designing to guidelines and standards.", "url": "http://learn.uwaterloo.ca", "prerequisites": "(Level at least 3B Systems Design Engineering) or Ergonomics Option or Biomechanics Option", "core_for_major": false, "last_taught": "10/06/2013, 00:00:00", "instructor": "Prof. Stacey D. Scott", "learning_goals": "The main goal of SYDE 348 is to familiarize students with a collection of human factors principles, tools, and techniques as they apply to user-centered design and the evaluation of human-machine systems. \r\nAn iterative design process with being the integrating focus for user-centered design tools, techniques, users and design team throughout\r\nSYDE 348.Explain and Justify the benefits and drawbacks of user-centered design as a method of engineering design\r\nDescribe effective design team behaviours and dynamics and Evaluate your contributions;\r\nc. Select and Use appropriate tools and techniques for communicating design concepts and for evaluating\r\nsystem usability\r\nExplain the relevance and process for conducting ethical research with human subjects;\r\nAnalyze feedback from appropriate systems stakeholders and Integrate into relevant design modifications;\r\nUnderstand basic user-centered design concepts through self-teaching from the textbook and other resources.", "equivalent": []}, {"slug": "qk1igSm698", "name": "Collaborative Systems Design", "code": "SYDE 643", "university": "University of waterloo", "description": "Interaction of humans with technological systems often takes place within the broader context of a\r\ncollaborative setting. Therefore, there is an increasing trend for the design of these systems to incorporate and support group interactions. This course will emphasize the study of collaboration from an\r\ninterdisciplinary perspective and the derivation of system design criteria. Topics will include group\r\ntheories, collaboration requirements (including communication, coordination, team awareness),\r\nquantitative and qualitative research methods (including laboratory studies, surveys, ethnographic\r\nresearch methods), data analysis, and collaboration technologies.", "url": null, "prerequisites": "(Level at least 3B Systems Design Engineering) or Ergonomics Option or Biomechanics Option", "core_for_major": false, "last_taught": "10/06/2014, 00:00:00", "instructor": "Prof. Stacey D. Scott", "learning_goals": "The objectives of this course are to provide students with a solid grounding in the broad, interdisciplinary field of studying and designing systems to support collaboration.\r\n The main objectives of this course are to provide students with the background knowledge and appropriate methodologies to study a collaborative environment, identify opportunities for technology to enhance existing collaboration, derive design criteria, and evaluate a new collaboration technology. This course aims to provide students with basic knowledge of the following: theoretical approaches from the social and organizational sciences for understanding small and large group interactions quantitative and qualitative methods for studying group work and collaboration technologies, analysis techniques for understanding data derived from both quantitative and qualitative studies, techniques for deriving technological requirements/design criteria, methods for evaluating new collaborative technologies, and an overview of existing collaborative technologies.", "equivalent": []}, {"slug": "Z1hGYhdkcf", "name": "Interfaces personne-machine", "code": "IFT 2905", "university": "University of Montreal", "description": "Concept et langages des interfaces. Programmation par événements. Modèle de l'usager. Design et programmation d'interfaces graphiques. Impact sur les multimédia, la collaboration et la communication.", "url": null, "prerequisites": "IFT1025; Equivalents: IFT2905 / IFT3904", "core_for_major": false, "last_taught": "10/06/2019, 00:00:00", "instructor": "Bernhard Thomaszewski", "learning_goals": "", "equivalent": []}, {"slug": "wPhYfcmfEY", "name": "Human-Computer Interaction", "code": "ECSE 424/542", "university": "McGill University", "description": "The course highlights the design, development, and evaluation of human-computer interfaces, with an emphasis on usability, interaction paradigms, computer-mediated human activities, and implications to society. These issues are studied from a number of perspectives including that of the engineer and end-user. A team-based project applies your knowledge and skills to the full life cycle of an interactive human-computer interface.", "url": "http://www.cim.mcgill.ca/~jer/courses/hci/", "prerequisites": "ECSE 322 or (ECSE 324 and COMP250) or (COMP 251 and COMP 273)", "core_for_major": false, "last_taught": "10/06/2019, 00:00:00", "instructor": "Jeremy R. Cooperstock", "learning_goals": "You will gain an overview of Human-Computer Interaction (HCI), with an understanding of user interface design in general, and alternatives to traditional \"keyboard and mouse\" computing become familiar with the vocabulary associated with sensory and cognitive systems as relevant to task performance by humans; be able to apply models from cognitive psychology to predicting user performance in various human-computer interaction tasks and recognize the limits of human performance as they apply to computer operation; appreciate the importance of a design and evaluation methodology that begins with and maintains a focus on the user; be familiar with a variety of both conventional and non-traditional user interface paradigms, the latter including virtual and augmented reality, mobile and wearable computing, and ubiquitous computing; and understand the social implications of technology and your ethical responsibilities as engineers in the design of technological systems. Finally, working in small groups on product design from start to finish will provide you with invaluable team-work experience.", "equivalent": []}, {"slug": "BeuvJwhui5", "name": "Introduction to Human Computer Interaction", "code": "CMPUT 302", "university": "University of Alberta", "description": "A complementary course to introductory software engineering focused on a user-centered approach to software design. The main themes are how humans interact with physical and information environments, and how to design software with human’s information needs and their cognitive capacities in mind. Topics include the user-centered design cycle and evaluation methods for discovering usability problems in interface design.", "url": "https://www.ualberta.ca/computing-science/undergraduate-studies/course-directory/courses/introduction-to-human-computer-interaction", "prerequisites": "CMPUT 301", "core_for_major": false, "last_taught": "10/06/2019, 00:00:00", "instructor": "Carrie Demmans Epp", "learning_goals": "Students will understand how human-perception relates to user interface design through their application of design principles and analysis of user interfaces. Students will be able to design system features that support user comprehension of complex information or tasks. Students will be able to decompose interactions into their constituent physical and cognitive elements to improve existing systems or features. Students will learn to select appropriate prototyping methods for their projects. Students will learn how to select usability evaluation methods based on the evaluation’s goal and the population who is meant to use the system.", "equivalent": []}, {"slug": "EAVd1CbfWC", "name": "Human-Computer Interaction", "code": "CS4HC3", "university": "McMaster University", "description": "Design of user interfaces. Principles of good interface design. Human input. Displaying complex data using graphics and virtual reality. Modes and mode awareness problem. Health issues, information overload. Special purpose graphics hardware. Interface design tools; on-line help systems.", "url": "http://www.cas.mcmaster.ca/~se4d03/index.html", "prerequisites": "COMPSCI 3MH3 or 3SH3", "core_for_major": false, "last_taught": "10/06/2010, 00:00:00", "instructor": "Dr.Skip Poehlman, P.Eng.", "learning_goals": "be familiar with human psychological characteristics of relevance to the human-computer interface (e.g. characteristics and limits of sensory perception, sources of frustration and distraction) be aware of the psychological and other differences between various  categories of users, examine some concepts in cognitive engineering know how to obtain the relevant information about the users  of the system to be designed, be able to critically evaluate human-computer interfaces, know how to design human computer interfaces for effective and easy operation in practice, taking into due account the above considerations as well as the technical possibilities and limitations of HCI hardware and software, be familiar with the typical building blocks and elements of human-computer interfaces (both from a hardware aspect  (devices: joystick, VDU, etc.) and software aspect (visual programming, WIMP, etc.)), learn about some of the tools (e.g. modeling languages) currently available to support designing human-computer interfaces, and, understand how issues of reliability, maintainability, testing, debugging, etc. influence the design of practical human-computer interfaces.\"", "equivalent": []}, {"slug": "o7XGZVnMmi", "name": "Human-Computer Interaction Models, Theories and Frameworks", "code": "CSI 5167", "university": "Ottawa University", "description": "A basis for graduate study in HCI with an emphasis on the application of theory to user interface design. Review of main theories of human behavior relevant to HCI, including especially Cognitive Dimensions of Notations Framework, Mental Models, Distributed Cognition, and Activity Theory, and their application to design and development of interactive systems. This course is equivalent to COMP 5210 at Carleton University.", "url": null, "prerequisites": null, "core_for_major": false, "last_taught": "10/06/2000, 00:00:00", "instructor": "nan", "learning_goals": "", "equivalent": []}, {"slug": "vB6QjidS3P", "name": "A Human Computer Interaction & Design", "code": "IMD 3004", "university": "Carleton University", "description": "Introduction to concepts centered on Human-Computer Interaction from hardware and software\r\n perspectives. Topics include design principles, usability principles, and engineering, solving user-centered\r\nproblems, device interaction, and graphical user interface design (2D and 3D interfaces).", "url": null, "prerequisites": null, "core_for_major": false, "last_taught": "10/06/2013, 00:00:00", "instructor": "Audrey Girouard", "learning_goals": "Describe a typical process used to understand people and contexts, enumerate tasks and requirements, and to evaluate the success of implemented interfaces. Critique interactive interface design using well-founded theoretical explanations. Recognize the impact of human-computer interaction in everyday life situations. Implement universal design techniques and apply standards for universal accessibility. Apply principles of good interface design in the creation of small scale systems. Work in small teams on a multi-step project. Write and speak clearly about issues and challenges in hardware and software interface design, specific challenges uncovered during their term project. Apply general mathematical models in the assessment of interaction technique efficiency and effectiveness.", "equivalent": []}, {"slug": "TA3y03XgY4", "name": "Human-Computer Interaction", "code": "COMP 3008", "university": "Carleton University", "description": "Fundamentals of the underlying theories, design principles, development and evaluation practices of human-computer interaction (HCI). Topics may include: theories of interaction, user interface frameworks, desktop, web, mobile, and immersive applications, usability inspection and testing methods, and qualitative and quantitative approaches to HCI research.", "url": null, "prerequisites": "one of COMP 2404, SYSC 3010, SYSC 3110 and COMP 2406.", "core_for_major": false, "last_taught": "10/06/2019, 00:00:00", "instructor": "nan", "learning_goals": "", "equivalent": []}, {"slug": "SB97YbAxx0", "name": "User Interface Design", "code": "SOEN 357", "university": "Concordia University", "description": "The human side: I/O; memory; and information processing. Interaction: mental models; human error; interaction frameworks and paradigms. Direct manipulation. User interface design: principles; standards; and guidelines. User-centered design: standards and design rationale; heuristic evaluation; iterative design; and prototyping. Task-centered design. Rationalized design: usability engineering; dialogue notations; user models; diagrammatic notations; and textual notations. Evaluation: with the user; without the user; quantitative; and qualitative. Implementation support. Help and documentation. Lectures: three hours per week. Tutorial: one hour per week.", "url": null, "prerequisites": "SOEN 341", "core_for_major": false, "last_taught": "10/06/2000, 00:00:00", "instructor": "nan", "learning_goals": "", "equivalent": []}, {"slug": "z7hMW8oOGN", "name": "Human-Computer Interaction", "code": "CISC 325", "university": "Queen's University", "description": "Developing usable software requires that human factors be considered throughout the design and development process. This course introduces a series of techniques for developing and evaluating usable software and shows how these techniques can be integrated into a process for software development.", "url": null, "prerequisites": "CISC-124/3.0, CISC-235/3.0", "core_for_major": false, "last_taught": "10/06/2007, 00:00:00", "instructor": "Nick Graham", "learning_goals": "This introductory course on Human-Computer Interaction provides students an opportunity to explore the techniques necessary to design, build and evaluate effective user interfaces. Students examine the physical, psychological, and behavioral characteristics of the user, and then examine their impact on system performance. The course also presents a formal design process that places the user's needs at the forefront. Processes for brainstorming, early design, interface construction, and interface evaluation are presented.", "equivalent": []}, {"slug": "7DiAboIv5N", "name": "Human-Computer Interaction I", "code": "CPSC 481", "university": "University of Calgary", "description": "Fundamental theory and practice of the design, implementation, and evaluation of human-computer interfaces. principles of design; methods for evaluating interfaces with or without user involvement; techniques for prototyping and implementing graphical user interfaces.\r\nThis course may not be repeated for credit.", "url": "https://silvadasilva.github.io/CPSC481-2019W/en/#!index.md", "prerequisites": "One of Software Engineering 300, 301 or Data Science 311.", "core_for_major": false, "last_taught": "10/06/2014, 00:00:00", "instructor": "Tiago Da Silva (tiago.dasilva@ucalgary.ca)", "learning_goals": "Course Outcomes: Explain and reason with core concepts from human-computer interaction, design, psychology and cognitive science– such as affordances, signifiers, and “Recognition vs. Recall” – and describe existing interfaces based on these principles. Understand and apply specific user-centered design methods (for user research, ideation, prototyping, and evaluation) to design problems and situations (e.g. task and goal-centered system design, IDEO Method Cards). Generate design ideas grounded in user research, and rationalize the connection from a design concept back to observations of people’s real-world behavior. Prototype user interfaces using low-level (e.g., paper prototyping, pictures, storyboarding), mid-level (e.g., wireframing) and high-fidelity techniques (e.g., C#).Constructively evaluate and critique interfaces (e.g., via usability walkthroughs and design heuristics), identifying effective design elements, design weaknesses that require revision, and opportunities for improvement. Demonstrate design communication skills to present user research and design concepts to elicit criticism and feedback — including hand sketching, prototyping, personas, scenarios, as well as verbal, written, and video presentations.", "equivalent": []}, {"slug": "tpqPP5LIHP", "name": "Human-Computer Interaction II", "code": "CPSC 581", "university": "University of Calgary", "description": "Intermediate and advanced topics and applications in human-computer interaction, to further one's skills for designing highly interactive human-computer interfaces.", "url": "https://pages.cpsc.ucalgary.ca/~sonny.chan/cpsc581/", "prerequisites": "CPSC 481 and consent of the Department.", "core_for_major": false, "last_taught": "10/06/2015, 00:00:00", "instructor": "Sonny Chan and David Ledo", "learning_goals": "This second undergraduate course in Human-Computer Interaction concentrates on having students acquire skills in creative aspects of Interaction Design. It is an unusual course for computer science as it somewhat follows the structure of a design studio: students mostly learn by doing rather than by listening to lectures. Course outcomes: By the end of the course, students should be able to summarize the key stages of the design process. by the end of the course, students should be able to explain the purpose and importance of sketching in the design process. By the end of the course, students should be able to explore, refine, and communicate design ideas through the use of sketching. By the end of the course, students should be able to apply design thinking to sketch and prototype solutions to a variety of real-world problems. By the end of the course, students should be able to debate the merits and limitations of alternative existing designs that address a given problem By the end of the course, students should be able to demonstrate the ability to strengthen a peer’s design ideas through design critique. By the end of the course, students should be able to prepare an online portfolio that records and presents their work in an appealing manner.", "equivalent": ["iZ4R00sYVo"]}, {"slug": "8HKIYAUjsn", "name": "Human Computer Interaction", "code": "SENG 310", "university": "University of Victoria", "description": "Understanding human behavior as it applies to user interfaces: work activity analysis, observational techniques, questionnaire administration, and unobtrusive measures. Operating parameters of the human cognitive system, task analysis, and cognitive modeling techniques and their application to designing interfaces. Interaction design principles and prototyping techniques. Evaluation techniques including cognitive walkthroughs, usability studies and verbal protocol analysis are used to evaluate interface design. Case studies of specific user interfaces.", "url": "https://heat.csc.uvic.ca/coview/course/2019051/SENG310", "prerequisites": "One of SENG 221, SENG 265, CENG 241, ECE 241.", "core_for_major": false, "last_taught": "10/06/2019, 00:00:00", "instructor": "Charles Perin", "learning_goals": "Establish target users, functional requirements, and interface requirements for a given computerized application Describe and explain user interface design principles, and apply them to designing an interface Develop preliminary interface designs using rapid prototyping methods Evaluate user interface quality Develop user studies and analyze study data to gain information about users, tasks, and interface designs Choose appropriate HCI methods for specified goals and justify the choices madeUnderstand emerging topics in HCI research", "equivalent": []}, {"slug": "CWShYFzIk9", "name": "Advanced Methods for Human Computer Interaction", "code": "SENG 411", "university": "University of Victoria", "description": "Laboratory course building on the interaction design process. Theory and application of advanced methods for design and evaluation, including interface prototyping and design techniques; experiments and observational studies both in the laboratory and in the field; methods for statistical and qualitative analysis. Advanced topics: underlying models of human-computer interaction; new trends in interaction design; and research frontiers. Students undertake a major team project.", "url": "https://web.uvic.ca/calendar2019-05/CDs/SENG/411.html", "prerequisites": "SENG 310; and one of STAT 252, STAT 254, STAT 255, STAT 260", "core_for_major": false, "last_taught": "10/06/2011, 00:00:00", "instructor": "Melanie Tory", "learning_goals": "", "equivalent": []}, {"slug": "FqdCayUwFm", "name": "HUMAN-COMPUTER INTERACTION", "code": "Computer Science 4474A/B", "university": "Western University", "description": "Exposure to topics in human-computer interaction, including frameworks for human-computer interaction; requirements gathering; rapid prototyping; user interface systems and tool kits.", "url": "http://www.csd.uwo.ca/misc/outlines/2018/2018-cs4474-b.pdf", "prerequisites": "Computer Science 3307A/B/Y", "core_for_major": false, "last_taught": "10/06/2018, 00:00:00", "instructor": "Dr. Kamran Sedig", "learning_goals": "To identify and describe HCI concepts/terminology/issues used in the design and evaluation of interactive\r\ncomputing systems\r\nTo design human-centered software, consciously incorporating and applying HCI principles in the design process\r\nTo evaluate the effectiveness of a piece of software in the light of the discussed HCI principles\r\nTo think deeply about users’ needs and distinguish the differences between system-centered design and human-centered design", "equivalent": []}, {"slug": "8rk1eBD0mY", "name": "Human-Computer Interaction 1", "code": "COMP 3020", "university": "University of Manitoba", "description": "human factors and usability, user-centered design, prototyping, usability evaluation.", "url": "https://www.cs.umanitoba.ca/~comp3020/", "prerequisites": "one of COMP 2140 or COMP 2061 (C). A course in cognitive psychology, such as PSYC 2480, is recommended", "core_for_major": false, "last_taught": "10/06/2019, 00:00:00", "instructor": "Pourang Irani", "learning_goals": "", "equivalent": []}, {"slug": "xAhoHedYeR", "name": "Human-Computer Interaction 2", "code": "COMP 4020", "university": "University of Manitoba", "description": "Advanced issues in the field of human-computer interaction. Topics will be selected from current research and development issues in the field of HCI.", "url": "https://www.cs.umanitoba.ca/~comp4020/", "prerequisites": "COMP 3020 (C). A course in cognitive psychology such as PSYC 2480 is recommended", "core_for_major": false, "last_taught": "10/06/2017, 00:00:00", "instructor": "Andrea Bunt", "learning_goals": "", "equivalent": ["NrbH3xvKSf"]}, {"slug": "BamEbxejtN", "name": "Human-Computer Interaction", "code": "LE/EECS 4441", "university": "York University", "description": "Introduces the concepts and technologies necessary to design, manage and implement interactive software. Students work in small groups and learn how to design user interfaces, how to realize them and how to evaluate the end result. Both design and evaluation are emphasized.", "url": "https://www.eecs.yorku.ca/course_archive/2018-19/F/4441/", "prerequisites": "cumulative GPA of 4.50 or better over all major EECS courses (without second digit \"5\"); LE/EECS 2030 3.00 or LE/EECS 1030 3.00; LE/EECS 3461 3.00. Previously offered as: LE/CSE 4441 3.00", "core_for_major": false, "last_taught": "10/06/2018, 00:00:00", "instructor": "Scott MacKenzie", "learning_goals": "", "equivalent": []}, {"slug": "fDLbxitgHq", "name": "HUMAN-COMPUTER INTERFACE DESIGN", "code": "CS/IT 321", "university": "University of Prince Edward Island", "description": "Fundamental theory and practice in the design, implementation, and evaluation of human-\r\ncomputer interfaces. principles of design, methods for evaluating interfaces with or\r\nwithout user involvement, techniques for prototyping and implementing graphical user interfaces.", "url": null, "prerequisites": "CS 1920", "core_for_major": false, "last_taught": "10/06/2019, 00:00:00", "instructor": "Scott Bateman, PhD", "learning_goals": "", "equivalent": []}, {"slug": "UnOoAaMTRz", "name": "HUMAN-COMPUTER INTERACTION", "code": "CSCI 6420U", "university": "University of Ontario Institute of Technology", "description": "This course is about the human side of computing: human-computer interaction. The focus of\r\nthe course is on the design and evaluation of usable and useful interactive computational\r\ninterfaces which enhance and support the cognitive, communicative, and creative capacities of\r\npeople. The course introduces research methods used to gain holistic and in-depth knowledge\r\nabout tasks, mental models, and contexts, in order to design interfaces that are responsive\r\nand supportive. The course will discuss the economic, safety, and productivity consequences of\r\npoorly designed interaction techniques and interfaces. Building on design thinking developed\r\nthrough case studies and critique exercises, the course will also introduce several interface\r\nimplementation technologies and standards, across a variety of computing modalities and\r\ncontexts, including desktop, web, mobile, gesture, virtual reality, and multi-touch hardware. Basic knowledge of HTML and Java is assumed. Classes will consist of lectures based on the course readings, relevant videos, and discussions of late-breaking research. Lab sessions will\r\nreview the data gathering methods, programming techniques, experimental methodologies, and\r\nalgorithms needed to complete the assignments, as well as allow students time to work with\r\nspecialized hardware required for some assignments.", "url": null, "prerequisites": null, "core_for_major": false, "last_taught": "10/06/2014, 00:00:00", "instructor": "Dr. Christopher Collins", "learning_goals": "Describe a typical process used to understand people and contexts, enumerate tasks and requirements, and to evaluate the success of implemented interfaces. Critique interactive interface design using well-founded theoretical explanations. Recognize the impact of human-computer interaction in everyday life situations. Implement universal design techniques and apply standards for universal accessibility. Apply principles of good interface design in the creation of small scale systems. Work in small teams on a multi-step project. Write and speak clearly about issues and challenges in hardware and software interface design, specific challenges uncovered during their term project. Apply general mathematical models in the assessment of interaction technique efficiency and effectiveness.", "equivalent": []}, {"slug": "Cu4aAUx7h4", "name": "HUMAN-COMPUTER INTERACTION", "code": "CMPT 481/811", "university": "University of Saskatchewan", "description": "Fundamental theory and practice in the design, implementation, and evaluation of human-computer interfaces.", "url": null, "prerequisites": null, "core_for_major": false, "last_taught": "10/06/2019, 00:00:00", "instructor": "Dr. Regan Mandryk", "learning_goals": "Read and critique the seminal work on human-computer interaction. Practice the skills of ideation, low-fidelity prototyping, and medium-fidelity prototyping. Evaluate the usability of a system through techniques that do not involve the end-user (e.g., heuristic evaluation) and those that do involve an end-user (e.g., controlled user studies). Iterate on an interface using the results of the evaluation. Implement an interface, using the skills of ideation, prototyping, and evaluation. Present and communicate their interface and evaluation through a project report, project presentation, and project video – similar to how human-computer interaction research and case studies are presented in the community.", "equivalent": []}, {"slug": "oso3GTRWoz", "name": "Introduction to Human-Centered Computing", "code": "CS 6451", "university": "Georgia Institute of Technology", "description": "", "url": "https://www.cc.gatech.edu/~asb/teaching/6451/fall2013/", "prerequisites": null, "core_for_major": false, "last_taught": "09/23/2013, 00:00:00", "instructor": "Amy Bruckman", "learning_goals": "This class provides an introduction to the field of Human-Centered Computing. It is designed for incoming, first semester HCC PhD students. Students from other degree programs are warmly welcome, if they are willing to do significant reading. Email the instructor, Amy Bruckman asb@cc.gatech.edu, for a permit.\r\n\r\nThis class introduces students to theoretical readings and their successful application to human-centered computing. Much of the reading is challenging. The class is recommended for students with a theoretical bent. Master's students considering a PhD in the future may enjoy this class. If you are an interdisciplinary student mainly seeking out a general introduction to how computing systems for humans are designed, then the class you are looking for is most likely CS 6750, Human-Computer Interaction.\r\n\r\nTopics covered include an introduction to a wide range of theories, and their application to the design of interactive computing systems, including:\r\n\r\nSociology of science and technology\r\nEpistemology\r\nSocial construction of technology\r\nCategory theory\r\nActivity theory\r\nDistributed cognition\r\nCulture\r\nIdentity and presentation of self online\r\nLearning\r\nUbiquitous computing\r\n\r\nWherever possible, we try to pair a theoretical reading with an application of that theory to human-centered computing. The application papers are not necessarily foundational to the field, but are good examples of the use of theories and illustrate theory's relevance.", "equivalent": []}]